PromotionsService.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="PromotionsService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="http://localhost:18474/PromotionsService.svc?xsd=xsd0" namespace="http://tempuri.org/"/><xsd:import schemaLocation="http://localhost:18474/PromotionsService.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/></xsd:schema></wsdl:types><wsdl:message name="IPromotionsService_GetRecommendedPromotion_InputMessage"><wsdl:part name="parameters" element="tns:GetRecommendedPromotion"/></wsdl:message><wsdl:message name="IPromotionsService_GetRecommendedPromotion_OutputMessage"><wsdl:part name="parameters" element="tns:GetRecommendedPromotionResponse"/></wsdl:message><wsdl:portType name="IPromotionsService"><wsdl:operation name="GetRecommendedPromotion"><wsdl:input wsaw:Action="http://tempuri.org/IPromotionsService/GetRecommendedPromotion" message="tns:IPromotionsService_GetRecommendedPromotion_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPromotionsService/GetRecommendedPromotionResponse" message="tns:IPromotionsService_GetRecommendedPromotion_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IPromotionsService" type="tns:IPromotionsService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetRecommendedPromotion"><soap:operation soapAction="http://tempuri.org/IPromotionsService/GetRecommendedPromotion" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="PromotionsService"><wsdl:port name="BasicHttpBinding_IPromotionsService" binding="tns:BasicHttpBinding_IPromotionsService"><soap:address location="http://localhost:18474/PromotionsService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>